In [ ]:
# Cargar todas las librerías
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from matplotlib import style

# Carga los datos
df = pd.read_csv('')

Exploración de datos

In [ ]:
# Vamos a ver cuántas filas y columnas tiene nuestro conjunto de datos
print(df.shape)

(21525, 12)

In [ ]:
# vamos a mostrar las primeras filas N
df.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding
5,0,-926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house
6,0,-2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions
7,0,-152.779569,50,SECONDARY EDUCATION,1,married,0,M,employee,0,21731.829,education
8,2,-6929.865299,35,BACHELOR'S DEGREE,0,civil partnership,1,F,employee,0,15337.093,having a wedding
9,0,-2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family

In [ ]:
# Obtener información sobre los datos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [ ]:
# Veamos la tabla filtrada con valores ausentes de la primera columna donde faltan datos

pd.isna(df['days_employed']).sum()

2174

In [ ]:
# Apliquemos múltiples condiciones para filtrar datos y veamos el número de filas en la tabla filtrada.

df[df['days_employed'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21497,0,NaN,48,BACHELOR'S DEGREE,0,married,0,F,business,0,NaN,building a property
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

In [ ]:
# Vamos a investigar a los clientes que no tienen datos sobre la característica identificada y la columna con los valores ausentes

df[(df['education'] == 'secondary education') & df['days_employed'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21423,0,NaN,63,secondary education,1,married,0,M,retiree,0,NaN,purchase of a car
21426,0,NaN,49,secondary education,1,married,0,F,employee,1,NaN,property
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

In [ ]:
# Comprobación de la distribución

df[(df['education'] == 'secondary education') & df['days_employed'].isna()].describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,1408.000000,0.0,1408.000000,1408.0,1408.000000,1408.000000,0.0
mean,0.536932,NaN,44.544744,1.0,0.911932,0.090909,NaN
std,1.484839,NaN,12.557846,0.0,1.358089,0.287582,NaN
min,-1.000000,NaN,0.000000,1.0,0.000000,0.000000,NaN
25%,0.000000,NaN,35.000000,1.0,0.000000,0.000000,NaN
50%,0.000000,NaN,44.000000,1.0,0.000000,0.000000,NaN
75%,1.000000,NaN,55.000000,1.0,1.000000,0.000000,NaN
max,20.000000,NaN,73.000000,1.0,4.000000,1.000000,NaN

In [ ]:
# Comprobando la distribución en el conjunto de datos entero

df.describe()

,children,days_employed,dob_years,education_id,family_status_id,debt,total_income
count,21525.000000,19351.000000,21525.000000,21525.000000,21525.000000,21525.000000,19351.000000
mean,0.538908,63046.497661,43.293380,0.817236,0.972544,0.080883,26787.568355
std,1.381587,140827.311974,12.574584,0.548138,1.420324,0.272661,16475.450632
min,-1.000000,-18388.949901,0.000000,0.000000,0.000000,0.000000,3306.762000
25%,0.000000,-2747.423625,33.000000,1.000000,0.000000,0.000000,16488.504500
50%,0.000000,-1203.369529,42.000000,1.000000,0.000000,0.000000,23202.870000
75%,1.000000,-291.095954,53.000000,1.000000,1.000000,0.000000,32549.611000
max,20.000000,401755.400475,75.000000,4.000000,4.000000,1.000000,362496.645000

In [ ]:
# Comprueba otras razones y patrones que podrían llevar a valores ausentes

df[(df['education_id'] == 1) & df['days_employed'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21426,0,NaN,49,secondary education,1,married,0,F,employee,1,NaN,property
21489,2,NaN,47,Secondary Education,1,married,0,M,business,0,NaN,purchase of a car
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

In [ ]:
# Comprobación de otros patrones: explica cuáles
## En este codigo comprobaré si total_income tiene correlación con las demas variables y sus datos faltantes
df[(df['education'] == 'secondary education') & df['total_income'].isna()]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
12,0,NaN,65,secondary education,1,civil partnership,1,M,retiree,0,NaN,to have a wedding
26,0,NaN,41,secondary education,1,married,0,M,civil servant,0,NaN,education
29,0,NaN,63,secondary education,1,unmarried,4,F,retiree,0,NaN,building a real estate
41,0,NaN,50,secondary education,1,married,0,F,civil servant,0,NaN,second-hand car purchase
55,0,NaN,54,secondary education,1,civil partnership,1,F,retiree,1,NaN,to have a wedding
...,...,...,...,...,...,...,...,...,...,...,...,...
21423,0,NaN,63,secondary education,1,married,0,M,retiree,0,NaN,purchase of a car
21426,0,NaN,49,secondary education,1,married,0,F,employee,1,NaN,property
21495,1,NaN,50,secondary education,1,civil partnership,1,F,employee,0,NaN,wedding ceremony
21502,1,NaN,42,secondary education,1,married,0,F,employee,0,NaN,building a real estate
21510,2,NaN,28,secondary education,1,married,0,F,employee,0,NaN,car purchase

In [ ]:
# Veamos todos los valores en la columna de educación para verificar si será necesario corregir la ortografía y qué habrá que corregir exactamente
df['education'].unique()

array(["bachelor's degree", 'secondary education', 'Secondary Education',
       'SECONDARY EDUCATION', "BACHELOR'S DEGREE", 'some college',
       'primary education', "Bachelor's Degree", 'SOME COLLEGE',
       'Some College', 'PRIMARY EDUCATION', 'Primary Education',
       'Graduate Degree', 'GRADUATE DEGREE', 'graduate degree'],
      dtype=object)

In [ ]:
# Arregla los registros si es necesario
df['education'] = df['education'].str.lower()

In [ ]:
# Comprobar todos los valores en la columna para asegurarnos de que los hayamos corregido
df['education'].unique()

array(["bachelor's degree", 'secondary education', 'some college',
       'primary education', 'graduate degree'], dtype=object)

In [ ]:
# Veamos la distribución de los valores en la columna `children`
df['children'].describe()

count    21525.000000
mean         0.538908
std          1.381587
min         -1.000000
25%          0.000000
50%          0.000000
75%          1.000000
max         20.000000
Name: children, dtype: float64

In [ ]:
# [arregla los datos según tu decisión]
df['children'] = df['children'].replace(20, 2)
df['children'] = df['children'].replace(-1, 1)

In [ ]:
# Comprobar la columna `children` de nuevo para asegurarnos de que todo está arreglado

df['children'].describe()

count    21525.000000
mean         0.479721
std          0.755528
min          0.000000
25%          0.000000
50%          0.000000
75%          1.000000
max          5.000000
Name: children, dtype: float64

In [ ]:
# Encuentra datos problemáticos en `days_employed`, si existen, y calcula el porcentaje
## El 15% de los datos son problemáticos
df['days_employed'].describe()

count     19351.000000
mean      63046.497661
std      140827.311974
min      -18388.949901
25%       -2747.423625
50%       -1203.369529
75%        -291.095954
max      401755.400475
Name: days_employed, dtype: float64

In [ ]:
# Aborda los valores problemáticos, si existen.
df['days_employed'] = df['days_employed'].abs()
valor_parche = 14600
df.loc[df['days_employed'] > 18250, 'days_employed' ] = valor_parche

In [ ]:
# Comprueba el resultado - asegúrate de que esté arreglado
print(df['days_employed'])

0         8437.673028
1         4024.803754
2         5623.422610
3         4124.747207
4        14600.000000
             ...
21520     4529.316663
21521    14600.000000
21522     2113.346888
21523     3112.481705
21524     1984.507589
Name: days_employed, Length: 21525, dtype: float64

In [ ]:
# Revisa `dob_years` en busca de valores sospechosos y cuenta el porcentaje
## Su porcentaje representa el 0.4%
df[df['dob_years'] == 0]

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
99,0,14600.000000,0,secondary education,1,married,0,F,retiree,0,11406.644,car
149,0,2664.273168,0,secondary education,1,divorced,3,F,employee,0,11228.230,housing transactions
270,3,1872.663186,0,secondary education,1,married,0,F,employee,0,16346.633,housing renovation
578,0,14600.000000,0,secondary education,1,married,0,F,retiree,0,15619.310,construction of own property
1040,0,1158.029561,0,bachelor's degree,0,divorced,3,F,business,0,48639.062,to own a car
...,...,...,...,...,...,...,...,...,...,...,...,...
19829,0,NaN,0,secondary education,1,married,0,F,employee,0,NaN,housing
20462,0,14600.000000,0,secondary education,1,married,0,F,retiree,0,41471.027,purchase of my own house
20577,0,14600.000000,0,secondary education,1,unmarried,4,F,retiree,0,20766.202,property
21179,2,108.967042,0,bachelor's degree,0,married,0,M,business,0,38512.321,building a real estate
21313,0,1268.487728,0,secondary education,1,unmarried,4,M,employee,0,24387.070,housing transactions

In [ ]:
df.loc[df['dob_years']!= 0, 'dob_years'].median()

43.0

In [ ]:
# Resuelve los problemas en la columna `dob_years`, si existen
df['dob_years'] = df['dob_years'].replace(0, 43)

In [ ]:
# Comprueba el resultado - asegúrate de que esté arreglado
df[df['dob_years'] == 0]

Empty DataFrame
Columns: [children, days_employed, dob_years, education, education_id, family_status, family_status_id, gender, income_type, debt, total_income, purpose]
Index: []

In [ ]:
# Veamos los valores de la columna
print(df['family_status'].unique())
print('*'*30)

print(df.groupby('family_status')['dob_years'].count())
print('*'*30)

['married' 'civil partnership' 'widow / widower' 'divorced' 'unmarried']
******************************
family_status
civil partnership     4177
divorced              1195
married              12380
unmarried             2813
widow / widower        960
Name: dob_years, dtype: int64
******************************

In [ ]:
# Aborda los valores problemáticos en `family_status`, si existen

## No hay

In [ ]:
# Comprueba el resultado - asegúrate de que esté arreglado
## No hay

In [ ]:
# Veamos los valores en la columna
print(df['gender'].unique())
print('*'*30)

print(df.groupby('gender')['dob_years'].count())
print('*'*30)

['F' 'M' 'XNA']
******************************
gender
F      14236
M       7288
XNA        1
Name: dob_years, dtype: int64
******************************

In [ ]:
# Aborda los valores problemáticos, si existen
df['gender'] = df['gender'].replace('XNA', 'F')

In [ ]:
# Comprueba el resultado - asegúrate de que esté arreglado

print(df['gender'].unique())
print('*'*30)

print(df.groupby('gender')['dob_years'].count())
print('*'*30)

['F' 'M']
******************************
gender
F    14237
M     7288
Name: dob_years, dtype: int64
******************************

In [ ]:
# Veamos los valores en la columna
print(df['income_type'].unique())
print('*'*30)

print(df.groupby('income_type')['dob_years'].count())
print('*'*30)

['employee' 'retiree' 'business' 'civil servant' 'unemployed'
 'entrepreneur' 'student' 'paternity / maternity leave']
******************************
income_type
business                        5085
civil servant                   1459
employee                       11119
entrepreneur                       2
paternity / maternity leave        1
retiree                         3856
student                            1
unemployed                         2
Name: dob_years, dtype: int64
******************************

In [ ]:
# Aborda los valores problemáticos, si existen
## No hay

In [ ]:
# Comprueba el resultado - asegúrate de que esté arreglado

print(df['income_type'].unique())
print('*'*30)

print(df.groupby('income_type')['dob_years'].count())
print('*'*30)

['employee' 'retiree' 'business' 'civil servant' 'unemployed'
 'entrepreneur' 'student' 'paternity / maternity leave']
******************************
income_type
business                        5085
civil servant                   1459
employee                       11119
entrepreneur                       2
paternity / maternity leave        1
retiree                         3856
student                            1
unemployed                         2
Name: dob_years, dtype: int64
******************************

In [ ]:
# Comprobar los duplicados

df.duplicated().sum()

71

In [ ]:
# Aborda los duplicados, si existen
df = df.drop_duplicates().reset_index(drop
= True)

In [ ]:
# Última comprobación para ver si tenemos duplicados
df.duplicated().sum()

0

In [ ]:
# Comprueba el tamaño del conjunto de datos que tienes ahora, después de haber ejecutado estas primeras manipulaciones
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21454 entries, 0 to 21453
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21454 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21454 non-null  int64
 3   education         21454 non-null  object
 4   education_id      21454 non-null  int64
 5   family_status     21454 non-null  object
 6   family_status_id  21454 non-null  int64
 7   gender            21454 non-null  object
 8   income_type       21454 non-null  object
 9   debt              21454 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21454 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

# Trabajar con valores ausentes

In [ ]:
# Encuentra los diccionarios
df.groupby(['family_status_id', 'family_status'])['family_status_id'].count()

family_status_id  family_status
0                 married              12339
1                 civil partnership     4151
2                 widow / widower        959
3                 divorced              1195
4                 unmarried             2810
Name: family_status_id, dtype: int64

In [ ]:
# Vamos a escribir una función que calcule la categoría de edad
def cat_edad(x):
    if x <=28:
        return 'Adulto joven'
    if x <= 64:
        return 'Adulto mayor'
    else:
        return 'Retirado'

In [ ]:
# Prueba si la función funciona bien
cat_edad(50)

'Adulto mayor'

In [ ]:
# Crear una nueva columna basada en la función
df['cat_edades'] = df['dob_years'].apply(cat_edad)

In [ ]:
# Comprobar cómo los valores en la nueva columna
df['cat_edades']

0        Adulto mayor
1        Adulto mayor
2        Adulto mayor
3        Adulto mayor
4        Adulto mayor
             ...
21449    Adulto mayor
21450        Retirado
21451    Adulto mayor
21452    Adulto mayor
21453    Adulto mayor
Name: cat_edades, Length: 21454, dtype: object

In [ ]:
# Crea una tabla sin valores ausentes y muestra algunas de sus filas para asegurarte de que se ve bien
df_limpia = df.dropna()
df_limpia.head(10)

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose,cat_edades
0,1,8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house,Adulto mayor
1,1,4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase,Adulto mayor
2,0,5623.422610,33,secondary education,1,married,0,M,employee,0,23341.752,purchase of the house,Adulto mayor
3,3,4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education,Adulto mayor
4,0,14600.000000,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding,Adulto mayor
5,0,926.185831,27,bachelor's degree,0,civil partnership,1,M,business,0,40922.170,purchase of the house,Adulto joven
6,0,2879.202052,43,bachelor's degree,0,married,0,F,business,0,38484.156,housing transactions,Adulto mayor
7,0,152.779569,50,secondary education,1,married,0,M,employee,0,21731.829,education,Adulto mayor
8,2,6929.865299,35,bachelor's degree,0,civil partnership,1,F,employee,0,15337.093,having a wedding,Adulto mayor
9,0,2188.756445,41,secondary education,1,married,0,M,employee,0,23108.150,purchase of the house for my family,Adulto mayor

In [ ]:
# Examina los valores medios de los ingresos en función de los factores que identificaste
mean_total_income = df_limpia.groupby('income_type')['total_income'].mean()
print(mean_total_income)

income_type
business                       32386.793835
civil servant                  27343.729582
employee                       25820.841683
entrepreneur                   79866.103000
paternity / maternity leave     8612.661000
retiree                        21940.394503
student                        15712.260000
unemployed                     21014.360500
Name: total_income, dtype: float64

In [ ]:
# Examina los valores medianos de los ingresos en función de los factores que identificaste
median_total_income = df_limpia.groupby('income_type')['total_income'].median()
print(median_total_income)

income_type
business                       27577.2720
civil servant                  24071.6695
employee                       22815.1035
entrepreneur                   79866.1030
paternity / maternity leave     8612.6610
retiree                        18962.3180
student                        15712.2600
unemployed                     21014.3605
Name: total_income, dtype: float64

In [ ]:
#  Escribe una función que usaremos para completar los valores ausentes
def fill_income(row):
    estado = row['income_type']
    income = row['total_income']

    if np.isnan(income):
        return median_total_income[estado]
    else:
        return income

In [ ]:
# Comprueba si funciona
fill_income

In [ ]:
# Aplícalo a cada fila
copia_df = df.copy()

copia_df['total_income'] = copia_df.apply(fill_income, axis= 1)

In [ ]:
# Comprueba si tenemos algún error
copia_df['total_income'].isna().sum()

0

In [ ]:
# Reemplazar los valores ausentes si hay algún error
## Se sustituyeron los valores de manera correcta por sus medianas.

In [ ]:
# Comprobar el número de entradas en las columnas

copia_df['total_income']

0        40620.102
1        17932.802
2        23341.752
3        42820.568
4        25378.572
           ...
21449    35966.698
21450    24959.969
21451    14347.610
21452    39054.888
21453    13127.587
Name: total_income, Length: 21454, dtype: float64

In [ ]:
# Distribución de las medianas de `days_employed` en función de los parámetros identificados

median_days_employed = df_limpia.groupby('dob_years')['days_employed'].median()
median_days_employed.describe()

count       57.000000
mean      6006.939746
std       6002.722005
min        618.733817
25%       1446.622542
50%       2253.981630
75%      14600.000000
max      14600.000000
Name: days_employed, dtype: float64

In [ ]:
# Distribución de las medias de `days_employed` en función de los parámetros identificados
mean_days_employed = df_limpia.groupby('dob_years')['days_employed'].mean()
mean_days_employed.describe()

count       57.000000
mean      5767.270356
std       4734.925945
min        633.678086
25%       1817.373408
50%       3224.319617
75%      11135.416724
max      13826.185812
Name: days_employed, dtype: float64

In [ ]:
# Escribamos una función que calcule medias o medianas (dependiendo de tu decisión) según el parámetro identificado
def median_input(row):
    row_days_employed = row['days_employed']
    row_family_status = row['dob_years']
    if pd.isna(row_days_employed):
        return median_days_employed[row_family_status]
    else:
        return row_days_employed

In [ ]:
# Comprueba que la función funciona

median_input

In [ ]:
# Aplicar la función al income_type

copia_df['days_employed'] = copia_df.apply(median_input, axis=1)

In [ ]:
# Comprueba si la función funcionó

copia_df['income_type'].isna().sum()

0

In [ ]:
# Reemplazar valores ausentes
## Ya se ha realizado.

In [ ]:
# Comprueba las entradas en todas las columnas: asegúrate de que hayamos corregido todos los valores ausentes
copia_df.isna().sum()

children            0
days_employed       0
dob_years           0
education           0
education_id        0
family_status       0
family_status_id    0
gender              0
income_type         0
debt                0
total_income        0
purpose             0
cat_edades          0
dtype: int64

In [ ]:
# Muestra los valores de los datos seleccionados para la clasificación
copia_df.groupby('debt')['purpose'].value_counts()

debt  purpose
0     wedding ceremony              727
      to have a wedding             707
      having a wedding              704
      real estate transactions      620
      buy commercial real estate    614
                                   ...
1     getting an education           37
      buying a second-hand car       36
      housing renovation             35
      purchase of my own house       34
      education                      32
Name: purpose, Length: 76, dtype: int64

In [ ]:
# Comprobar los valores únicos
print(df['purpose'].unique())

['purchase of the house' 'car purchase' 'supplementary education'
 'to have a wedding' 'housing transactions' 'education' 'having a wedding'
 'purchase of the house for my family' 'buy real estate'
 'buy commercial real estate' 'buy residential real estate'
 'construction of own property' 'property' 'building a property'
 'buying a second-hand car' 'buying my own car'
 'transactions with commercial real estate' 'building a real estate'
 'housing' 'transactions with my real estate' 'cars' 'to become educated'
 'second-hand car purchase' 'getting an education' 'car'
 'wedding ceremony' 'to get a supplementary education'
 'purchase of my own house' 'real estate transactions'
 'getting higher education' 'to own a car' 'purchase of a car'
 'profile education' 'university education'
 'buying property for renting out' 'to buy a car' 'housing renovation'
 'going to university']

In [ ]:
# Escribamos una función para clasificar los datos en función de temas comunes
comprar_auto = 'car purchase', 'buying a second-hand car', 'buying my own car', 'cars', 'second-hand car purchase', 'car', 'to own a car', 'purchase of a car', 'to buy a car'
comprar_propiedad = 'purchase of the house', 'housing transactions', 'purchase of the house for my family', 'buy real estate', 'buy commercial real estate', 'buy residential real estate', 'construction of own property', 'property', 'building a property', 'transactions with commercial real estate', 'building a real estate', 'housing', 'transactions with my real estate', 'purchase of my own house', 'real estate transactions', 'buying property for renting out', 'housing renovation'
comprar_educacion = 'supplementary education', 'education', 'to become educated', 'getting an education', 'to get a supplementary education', 'getting higher education', 'profile education', 'university education', 'going to university'
comprar_boda = 'to have a wedding', 'having a wedding', 'wedding ceremony',

def clasif_datos(row):
    proposito = row['purpose']
    if proposito in comprar_auto:
        return 'Auto'
    if proposito in comprar_propiedad:
        return 'Propiedad'
    if proposito in comprar_educacion:
        return 'Educacion'
    if proposito in comprar_boda:
        return 'Boda'

In [ ]:
# Crea una columna con las categorías y cuenta los valores en ellas
copia_df['purpose_filtro'] = copia_df.apply(clasif_datos, axis=1)
copia_df['purpose_filtro'].value_counts()

Propiedad    10811
Auto          4306
Educacion     4013
Boda          2324
Name: purpose_filtro, dtype: int64

In [ ]:
# Revisar todos los datos numéricos en la columna seleccionada para la clasificación
## No es necesario

In [ ]:
# Obtener estadísticas resumidas para la columna
copia_df['purpose_filtro'].describe()

count         21454
unique            4
top       Propiedad
freq          10811
Name: purpose_filtro, dtype: object

In [ ]:
# Crear una función para clasificar en diferentes grupos numéricos basándose en rangos
## No es necesario debido a que ya habia creado una clasificación.

In [ ]:
# Crear una columna con categorías
## No es necesario

In [ ]:
# Contar los valores de cada categoría para ver la distribución
## No es necesario

In [ ]:
# Comprueba los datos sobre los hijos y los pagos puntuales
cantidad_hijos = copia_df.groupby('children')['debt'].count()
con_deuda = copia_df.groupby('children')['debt'].sum()

# Calcular la tasa de incumplimiento en función del número de hijos
for i in range(6):
    try:
        x = con_deuda[i]*100/cantidad_hijos[i]
        print(f'la tasa de incumplimiento para {i} cantidad de hijos es {x}')
    except:
        print('No se pudo realizar la operación')

la tasa de incumplimiento para 0 cantidad de hijos es 7.543822297920658
la tasa de incumplimiento para 1 cantidad de hijos es 9.165808444902163
la tasa de incumplimiento para 2 cantidad de hijos es 9.492481203007518
la tasa de incumplimiento para 3 cantidad de hijos es 8.181818181818182
la tasa de incumplimiento para 4 cantidad de hijos es 9.75609756097561
la tasa de incumplimiento para 5 cantidad de hijos es 0.0

In [ ]:
# Comprueba los datos del estado familiar y los pagos a tiempo
sit_familiar = copia_df.groupby('family_status')['debt'].count()
con_deuda = copia_df.groupby('family_status')['debt'].sum()
# Calcular la tasa de incumplimiento basada en el estado familiar
for i in range(5):
    try:
        x = con_deuda[i]*100/sit_familiar[i]
        print(f'la tasa de incumplimiento para {i} situación familiar es {x}')
    except:
        print('No se pudo realizar la operación')

la tasa de incumplimiento para 0 situación familiar es 9.349397590361447
la tasa de incumplimiento para 1 situación familiar es 7.112970711297071
la tasa de incumplimiento para 2 situación familiar es 7.5451819434313965
la tasa de incumplimiento para 3 situación familiar es 9.750889679715302
la tasa de incumplimiento para 4 situación familiar es 6.569343065693431

In [ ]:
copia_df['total_income'].describe()

count     21453.000000
mean      26451.382421
std       15710.314734
min        3306.762000
25%       17219.352000
50%       22815.103500
75%       31331.461000
max      362496.645000
Name: total_income, dtype: float64

In [ ]:
# Definir rangos entre el nivel de ingresos
def rangos_income(row):
    ingresos = row['total_income']
    if ingresos >= 31331.461000:
        return 'Ingreso mayor al 75%'
    if ingresos >= 22815.103500:
        return 'Ingreso mayor al 50% y menor al 75%'
    if ingresos >= 17219.352000:
        return 'Ingreso mayor al 25% y menor al 50%'
    else:
        return 'Ingreso menor al 25%'
copia_df['rangos_de_ingreso'] = copia_df.apply(rangos_income, axis=1)

In [ ]:
# Comprueba los datos del nivel de ingresos y los pagos a tiempo
rango_ingreso = copia_df.groupby('rangos_de_ingreso')['debt'].count()
con_deuda = copia_df.groupby('rangos_de_ingreso')['debt'].sum()
# Calcular la tasa de incumplimiento basada en el nivel de ingresos
for i in range(4):
    try:
        x = con_deuda[i]*100/rango_ingreso[i]
        print(f'la tasa de incumplimiento para {i} rango ingreso es {x}')
    except:
        print('No se pudo realizar la operación')

la tasa de incumplimiento para 0 rango ingreso es 8.815477276875342
la tasa de incumplimiento para 1 rango ingreso es 8.538212311797217
la tasa de incumplimiento para 2 rango ingreso es 7.140193885160328
la tasa de incumplimiento para 3 rango ingreso es 7.961961588663062

In [ ]:
# Consulta los porcentajes de tasa de incumplimiento para cada propósito del crédito y analízalos
dif_purpose = copia_df.groupby('purpose_filtro')['debt'].count()
con_deuda = copia_df.groupby('purpose_filtro')['debt'].sum()

for i in range(4):
    try:
        x = con_deuda[i]*100/dif_purpose[i]
        print(f'la tasa de incumplimiento para {i} proposito es {x}')
    except:
        print('No se pudo realizar la operación')

la tasa de incumplimiento para 0 proposito es 9.359033906177427
la tasa de incumplimiento para 1 proposito es 8.006887645286268
la tasa de incumplimiento para 2 proposito es 9.22003488661849
la tasa de incumplimiento para 3 proposito es 7.233373415965221

# Conclusión general

- Principalmente a lo largo del proyecto pudimos observar que existieron muchos valores faltantes y no existia correlacion entre los datos y los valores ausentes, tuvimos que ahondar mas en la preparación de los datos y su origen para poder imputarlos o eliminarlos si no representaban una muestra significativa para el desarrollo del proyecto.
- De igual manera para comprobar las hipotesis descubrimos que no existio correlacion entre los datos faltantes ni entre el incumplimiento de los pagos con ninguna otra variable.
- Se tuvo que llegar a un comun denominador para imputar los valores ausentes que en este proyecto la mayoria fueron por la mediana debido a que existian valores atipicos o "outliers" que disparaban la media entonces no se podia imputar con la media.
- Existian personas con dias de trabajo negativos a lo cual decidi suponer que fue un error de dedo o que a la hora de la importacion de la base de datos al csv se pusieron como valores negativos, por lo cual se uso el valor absoluto.
- Habia gente con mas de 1000 años de experiencia laboral lo cual es imposible entonces tambien supuse que se debia a un error en el cual quizas añadieron varios 0 de mas o fue error humano, se opto por imputar con la mediana.


- Debido a que ninguna de las hipotesis fue comprobada correcta podemos intuir que entonces ninguna variable entre si estuvo relacionada, por ende todo fue un mal uso de los datos ya sea por parte del usuario o del programa que los recolecto, debido a eso tuvimos que ahondar y profundizar la investigación para poder dar con una conclusión acertada que es que los valores finales no demuestran una significancia superior al 10% lo cual nos da una confiabilidad del 90%.